
[
    {
        "title": "Construction of New GWA Compliance Laboratory",
        "location": "GWA Upper Tumon Compound, Guam",
        "price": 2423016,
        "StartD": "September 15, 2016",
        "completionD": "December 17, 2017",
        "contractor": "Guam Waterworks Authority",
        "description": "Mega United Corp. had
completed all civil works including demolition of old structural grade
beams, waste removal and landscaping features in strict conformity
with project specs and EPA requirements; Asphalt pavement of parking
lot with complete traffic markings and signage. Electrical Mainline and
other communication lines were extended from street power pole via
hardened manhole to the main building. The main building of 6000sf
was constructed at 18’8” feet height roof completes with high-quality
AC and Exhaust Fan systems. Commercial lightings and 300kw
standby generator with ATS and 5000 gallons fuel storage tank were
constructed with complete fire alarm system. Interconnected Telecom
and Internet system was installed ready for hook-up with internet
provider. High-quality Anti-corrosion plumbing rough-in and fixtures
were unique for chemical testing purposes. Brand-name American
Kewaunee laboratory caseworks with fume hoods and testing features
represented first-in-kind testing center for Guam. This Project had
become a landmark water-testing building on Guam",
        "thumbnail": "https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/b/b7/bb7a7ed8-5ea9-11e6-b116-cb180d1bad89/57aa9e10e5a93.image.jpg"
    },
    {
        "title": "Construction and Relocation of Dededo Flea Market",
        "location": "Intersection of West Santa Monica Avenue and Marine Corp. Drive, Dededo Guam",
        "price": 3127016,
        "StartD": "July 7, 2014",
        "completionD": "December 17, 2015",
        "contractor": "Guam Economic Development Authority",
        "description": "With 8 Acres of Land Area,
Mega United Corp. had completed all civil works including waste
removal and grading,
        3 ponding basins with culverts and headwalls,
grand landscaping features in strict conformity with project specs and
EPA requirements; Asphalt pavement of parking lot of 5 acres with
complete traffic markings and signage. The civil work also included
12” main waterline extension and wet tapping; Electrical Mainline and
other communication lines were extended from across street power pole
via hardened manholes and cross-street conduit lay-outs to the main
building. The main building of 12000sf was constructed at 24 feet
height pitched roof complete with high-quality Mitsubishi AC system
and cold storage cooler and freezer units; Commercial lightings and
80kw standby generator with ATS. To meet strict Fire department and
EPA requirements a 35000 gallons fiberglass water tank was
constructed with complete fire pump system which had established new
farmers’ building as most conforming building on Guam. High-quality
plumbing Appliances with kitchen features had made this building
serving multi-functional purposes. Aluminum Doors and Storefronts
were rated more than 175mph; Interior HM/SCWD and HM/Metal
doors were with American Hardware sets. 10-year elastomeric roof
coatings system with insulated under slab Gypsum boards and/or
Acoustical ceilings had made this building truly energy-saving modern
facility for our Guam farmers. This Project was awarded with high
remarks from Governor Calvo, owner, designer and farmers; And will
become a landmark building on Guam."
    },
    {
        "title": "Construction of Paseo de Susana Fishing Platform",
        "location": "Paseo de susana Marine Park, Hagatna Guam",
        "price": 999370,
        "StartD": "October 15, 2015",
        "completionD": "July 27, 2018",
        "contractor": "Guam Department of Public Works",
        "description": "With Hagatna Marina
Channel in view, Mega United Corp. had completed all civil and
structural works in strict conformity with Army Corp of Engineers and
EPA requirements. 225’x19’2” view and fishing platform was
constructed with reinforced concrete footings, columns and walls of
epoxy-coated rebar. Precast reinforced concrete main beams of
epoxy–coated rebar was firmly anchored to underneath wall after crane
lifting operation; Hollow Aluminum Tubes served as distributing
beams to support fiberglass grates; Fiberglass railings with brackets
were securely fastened to Aluminum beams. This Project had set a
good example for marine construction. All kinds of anti-corrosion
materials were utilized and technically combined to fulfill intended
purposes. This platform has since provided recreational and subsistence
fishing access to the Hagatna Marina Channel complete with surface
ramps and ADA compliant decking, guardrails and wheel stops."
    },
    {
        "title": "Design & Build Synthetic Track System Replacement",
        "location": "John F. Kennedy high School; Tamuning, Guam",
        "price": 248710,
        "StartD": "July 10, 2017",
        "completionD": "December 15, 2017",
        "contractor": "Guam Department of Education",
        "description": "Mega United
Corp. had performed as prime contractor with FirstNet providing
performance and payment bonds. This project consisted of complete
removal and replacement of 400-meter track and field sport running
track for JFK high school. Upon removal of old deteriorated track,
Mega United Corp. had proposed to repair poor subbase and corrected
drainage conditions to prevent future subbase issues and conflicts;
Teamed with Off-island supplier We provided suitable track design for
approval and brought modern paving machinery with enhanced
material formulated for tropical climate. We also demonstrated skilled
workmanship to overcome any technical and construction challenges.
The successful completion on the sport running track provided solid
evidences that Mega United Corp. can mobilize and handle an
unconventional project with quality work."
    },
    {
        "title": "Structural Repairs & Roof Coatings at Northern/Central Schools, Guam",
        "location": [
            "LBJ Elementary School, Tamuning Guam",
            "Tamuning Elementary School, Tamuning Guam",
            "Chief Brodie Elementary School, Tamuning Guam",
            "Upi Elementary School, Yigo Guam"
        ],
        "price": 1317328,
        "StartD": "March 18, 2013",
        "completionD": "December 8, 2013",
        "contractor": "Guam Department of Education",
        "description": "Mega United
Corp. had performed as prime contractor with FirstNet providing
performance and payment bonds. This project consisted of complete
structural repairs and roof water proofing for 4 northern/central
schools. Under contract terms and specifications, the contractor was
required to epoxy inject structural cracks, correct roof water ponding
and apply 40 Mils water proofing elastomeric coatings. The scope of
work covered more than 360,
        000sf classrooms. This project was 100%
federal-funded through ARRA. During the course of the project, Mega
United Corp. had coordinated with both CM and PM to resolve any
issues and conflicts; provided value engineering proposals, and also
demonstrated skilled workmanship to overcome any technical and
construction challenges. The successful completion on 12/08/2013
provided solid evidences that Mega United Corp. can mobilize and
handle a project in large scale with quality work."
    },
    {
        "title": "Structural Repairs & Roof Coatings at Northern B Schools, Guam",
        "location": [
            "D.L.Perez Elementary School, Yigo Guam",
            "Simon Sanchez High School, Yigo Guam",
            "F.B. Leon Guerrero Middle School, Yigo Guam",
            "J.M. Guerrero Elementary School, Dededo Guam"
        ],
        "price": 1864606,
        "StartD": "December 17, 2012",
        "completionD": "December 20, 2013",
        "contractor": "Guam Department of Education",
        "description": "Mega United
Corp. had performed as prime contractor with FirstNet providing
performance and payment bonds. This project consisted of complete
structural repairs and roof water proofing for 4 northern schools. Under
contract terms and specifications, the contractor was required to epoxy
inject structural cracks, correct roof water ponding and apply 40 Mils
water proofing elastomeric coatings. The scope of work covered more
than 360,
        000sf classrooms. This project was 100% federal-funded
through ARRA. During the course of the project, Mega United Corp.
had coordinated with both CM and PM to resolve ant issues and
conflicts; provided value engineering proposals, and also demonstrated
skilled workmanship to overcome any technical and construction
challenges. The successful completion on 12/20/2013 provided solid
evidences that Mega United Corp. can mobilize and handle a project in
large scale with quality work."
    },
    {
        "title": "Chura 48 Housing Roofing Repairs",
        "location": "Intersection of West Santa Monica Avenue and Marine Corp. Drive, Dededo Guam",
        "price": 2659950,
        "StartD": "June 18, 2010",
        "completionD": "December 23, 2011",
        "contractor": "Guam Housing & Urban Renewal Authority",
        "description": "Ghura 48 Units had
deteriorated roofs which were structurally unsound with rusted rebars;
as a result, Ghura had to vacate all tenants for safety reasons and
demanded Mega United Corp. to break the project into 2 phases. The
first phase of 21 units had to be done before 03/25/2011 to allocate
tenants back to units as soon as possible to save Ghura relocation costs;
the second phase had to start on December 22,
        2010 in parallel with
phase one ongoing in order to minimize total construction period to
save government costs of providing alternative accommodation for
tenants. Mega United Corp. had made speedy mobilization to perform
under slab structural reinforcements; The techniques designed by
architects and structure engineers were unique in Guam with no
contractors having done sort of things before; Mega United Corp. had
coordinated with A/E firm to resolve all critical issues and conflicts
during the course of the construction. In addition, with other renovation
scope, our company were able to deliver refurbished units on time per
specs and exceed the owner’s expectations."
    },
    {
        "title": "Pete Seguenza Court Maite Subdivision",
        "location": "South Biang Street between Route 8 and Sgt. Roy T. Damian Road, Maite Guam",
        "price": 5850000,
        "StartD": "November 18, 2009",
        "completionD": "December 23, 2015",
        "contractor": "Mega United Corp. LTD.",
        "description": "After securing 5 Acres of such Maite prime land, Mega United Corp.
had promptly retained the service of Registered Land Surveyor Mr.
Robert Moya to subdivide the R-2 zone land into 13 individual lots and
brought main waterline and sewer line into each individual lots
complete with storm drainage system. These extensive civil works
involved massive grading, cut-and-fill of topographic contours;
complicated installations of all kind of manholes for water, sewer,
electrical, communication and storm drains. Four different type of 2-
storey houses were designed by Antonio Herrera and Cesar Somera etc.
according to lots of different topo configurations. Beautifully designed
and built houses had attracted a lot of high-end buyers including Wayne
Cornell/DZSP President, Joe San Nicolas/Fire Department Chief, Rino
Menzaro/GM for Mariana Energy Co. Mega United Corp. had
completed all scopes of work without need to invoke any subcontractor
services. All Electrical and Mechanical works, all civil works were
solely carried out by the company itself. Granite Counter-top and
quality Cabinet caseworks, multi-layer reflective ceilings with insulated
partitions complete with quality AC system and electrical fixtures had
earned Mega United Corp. a renowned developer for executive houses.
Mega United Corp. had also built and sold so many quality houses for our military servicemen and servicewomen; As a result, it was honored
by VA administration and then granted “VA Builder” title."
    },
    {
        "title": "Island-wide Gymnasium & Sports Facilities Designed-Build",
        "location": "Barrigada & Mangilao Guam",
        "price": 2256685,
        "StartD": "November 18, 2009",
        "completionD": "December 23, 2015",
        "contractor": "Guam Department of Park and Recreation",
        "description": "Activity performed was Design-Build new steel
gymnasium, Survey, re-established Property line and proper elevation
of basketball court, Basketball electronic accessories system, Painting
works, Power/Lighting system. Design-Build High Security Fence
including new storm drain and catch basin system, waterline for
fountain complete fixtures. Renovation of existing restroom with new
fixtures, accessories, lighting system &amp; outlets including parking lay-
out."
    },
    {
        "title": "Forty Executive Residential Subdivision Infrastructure Improvements",
        "location": "7145, Chalan Islas Marianas; Yigo, Guam",
        "price": 4880000,
        "StartD": "March 25, 2021",
        "completionD": "July 23, 2024",
        "contractor": "Mega United Corp. LTD.",
        "description": "Mega
United Corp. Activity performed was Land Development, Survey, re-
established Property line and road works. Installation of underground
electrical utilities. Housing units fully furnish &amp; Street lights system."
    },
    {
        "title": "Demolition and Construction of Community Arts Center",
        "location": "Sinajana Guam",
        "price": 1121897,
        "StartD": "March 4, 2020",
        "completionD": "June 1, 2022",
        "contractor": "Guam Housing & Urban Renewal Authority",
        "description": "Mega United Corp. scope of work for this project involves the
complete demolition of the existing community center in Sinajana
Guam, followed by the construction of a new Community Arts Center,
including all necessary site preparation, utilities, and finishes.
Demolition includes Site preparation, Building demolition, Utilities
disconnection, Debris Removal, Site Restoration. While Construction
of New Community Arts Center includes Foundation and Structure,
Exterior walls and roof, Interior walls and finishes, Utilities
installation, Accessibility, Landscaping, Signage and Wayfinding,
Interior design and furnishing, Testing and Commissioning."
    }
]